{
  "backend/main.mo": "Empty Motoko actor serving as a placeholder backend with no implemented functionality.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features documented.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend source files describing component purposes, data structures, and styling configurations for the Spyderstild gaming peripherals website.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color variables for light and dark themes, defining design tokens for backgrounds, borders, accents, and component styling.",
  "frontend/index.html": "HTML entry point that loads the React application into a root div and references the main TypeScript module.",
  "frontend/src/App.tsx": "Root React component that assembles the application layout with Header, HomePage main content, and Footer in a flex column structure.",
  "frontend/src/components/Footer.tsx": "Footer component with brand information, category navigation links with smooth scrolling, social media icons, copyright notice, and Caffeine.ai attribution with UTM tracking.",
  "frontend/src/components/Header.tsx": "Sticky header with Spyderstild logo, responsive desktop/mobile navigation menus for product categories (mice, keyboards, monitors, PC builds), and smooth scroll functionality.",
  "frontend/src/components/HeroSection.tsx": "Full-screen hero section featuring background image, animated gradient title, tagline, CTA button with smooth scroll to products, and decorative geometric elements.",
  "frontend/src/components/HomePage.tsx": "Main page component that renders the hero section followed by four product category sections (mice, keyboards, monitors, PC builds) with their respective data and accent colors.",
  "frontend/src/components/ProductCard.tsx": "Reusable product card component with hover effects, customizable neon borders in four colors, conditional background images for Hacking PC and Gaming PC, and spec list display.",
  "frontend/src/components/ProductCategorySection.tsx": "React component that renders a product category section with a title, description, banner image, and grid of product cards, supporting customizable neon accent colors (green, cyan, orange, red).",
  "frontend/src/data/products.ts": "Defines Product interface and exports arrays of product data for mice (6 products), keyboards (3 products), monitors (3 products), and PC builds with detailed specifications for each item.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages an actor instance for backend communication, supporting both authenticated (with Internet Identity) and anonymous modes, with automatic query invalidation on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file for React Query hooks to interact with the backend; currently no backend functionality is implemented for this static showcase site.",
  "frontend/src/index.css": "Global CSS with Tailwind imports, custom CSS variables for dark theme colors (including neon accent colors), custom scrollbar styling, and geometric clip-path utilities for the futuristic design.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client, Internet Identity provider, and renders the root App component.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color scheme (neon accents, dark theme), zero border radius for sharp geometric design, custom font families (Orbitron, Rajdhani, Inter), and animation keyframes.",
  "project_state.json": "Project metadata tracking the gaming PC website (www.spyderstild.shop) with architectural notes, existing features including product sections for peripherals and PC builds, and development history."
}