{
  "backend/main.mo": "Empty Motoko actor serving as a placeholder backend with no implemented functionality.",
  "feature_evidence.json": "Feature evidence report documenting five implemented features for PC builds section, including data additions, UI components, and navigation updates with high confidence ratings.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing components, data structures, and styling for the Spyderstild gaming peripherals website.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color variables for light and dark themes, defining neon accent colors and design system tokens.",
  "frontend/index.html": "HTML entry point with root div and module script reference for the React application titled 'Spyderstild Gaming PC Website'.",
  "frontend/src/App.tsx": "Root React component rendering Header, HomePage, and Footer in a flex layout with background styling.",
  "frontend/src/components/Footer.tsx": "Footer component with brand info, category navigation links (including PC Builds), social media icons, copyright notice, and Caffeine.ai attribution with UTM tracking.",
  "frontend/src/components/Header.tsx": "Sticky header with logo, desktop/mobile navigation menus for all product categories including PC Builds, and smooth scroll functionality to sections.",
  "frontend/src/components/HeroSection.tsx": "Full-screen hero section with background image, animated neon gradient title, tagline, CTA button, scroll indicator, and geometric decorative elements.",
  "frontend/src/components/HomePage.tsx": "Main page component orchestrating HeroSection and four ProductCategorySection components for mice, keyboards, monitors, and PC builds with respective accent colors.",
  "frontend/src/components/ProductCard.tsx": "Reusable product card with hover effects, neon borders, icon placeholder, product details, and specs list supporting four accent colors (green, cyan, orange, red).",
  "frontend/src/components/ProductCategorySection.tsx": "React component that renders a product category section with a title, description, banner image, and grid of product cards, supporting customizable neon accent colors (green, cyan, orange, red).",
  "frontend/src/data/products.ts": "Defines Product interface and exports product data arrays for mice, keyboards, monitors, and PC builds (Gaming PC with 9.3GB storage, Hacking PC with 12.8GB storage), each with specs and descriptions.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages an ICP backend actor instance, handling both authenticated and anonymous actors, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file for React Query hooks to interact with the backend; currently no backend functionality is implemented for this static showcase site.",
  "frontend/src/index.css": "Global CSS with Tailwind imports, custom CSS variables for dark theme colors (including neon accent colors), custom scrollbar styling, and geometric clip-path utilities for corner effects.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client, Internet Identity provider, and renders the root App component.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color scheme with neon accents, gaming-focused fonts (Orbitron, Rajdhani, Inter), zero border radius, and custom animations.",
  "project_state.json": "Project metadata tracking the gaming PC website (www.spyderstild.shop) with architectural notes, existing features including product sections for peripherals and PC builds, and image requirements."
}