{
  "backend/main.mo": "Empty Motoko actor serving as a placeholder backend with no functionality.",
  "feature_evidence.json": "Empty feature evidence report with no features documented.",
  "frontend-file-summaries.txt": "JSON metadata describing all frontend components, including the main App, Header with navigation, HomePage orchestrating sections, HeroSection, ProductCategorySection, ProductCard with hover effects, Footer, product data with mice/keyboards/monitors/PC builds, and styling configurations.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color variables for light and dark themes, including neon accent colors and design system tokens.",
  "frontend/index.html": "HTML entry point that loads the React app into a root div and references the main TypeScript module.",
  "frontend/src/App.tsx": "Root React component that renders Header, HomePage, and Footer in a flex layout structure.",
  "frontend/src/components/Footer.tsx": "Footer component with brand info, category navigation links with smooth scrolling, social media icons, copyright notice, and Caffeine.ai attribution with UTM tracking.",
  "frontend/src/components/Header.tsx": "Sticky header with Spyderstild logo, desktop/mobile navigation menus for product categories (Mice, Keyboards, Monitors, PC Builds), and smooth scroll functionality.",
  "frontend/src/components/HeroSection.tsx": "Full-screen hero section with background image, animated neon gradient title, tagline, CTA button with smooth scroll, and geometric decorative elements.",
  "frontend/src/components/HomePage.tsx": "Main page component that renders HeroSection followed by four ProductCategorySection components for mice, keyboards, monitors, and PC builds with their respective data and accent colors.",
  "frontend/src/components/ProductCard.tsx": "Reusable product card with hover effects, neon borders, conditional background images for Hacking PC (hacker face) and Gaming PC (spider), product specs list, and support for four accent colors.",
  "frontend/src/components/ProductCategorySection.tsx": "React component that renders a product category section with a title, description, banner image, and a grid of product cards, supporting different accent colors for theming.",
  "frontend/src/data/products.ts": "Defines the Product interface and exports arrays of product data for mice, keyboards, monitors, and PC builds with names, descriptions, icons, and specifications.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages an actor instance for backend communication, handling both authenticated and anonymous states based on Internet Identity.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login state, identity storage, and AuthClient lifecycle.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file for React Query hooks to interact with the backend; currently unused as the site is static.",
  "frontend/src/index.css": "Global CSS file importing fonts, Tailwind directives, defining CSS custom properties for dark theme colors including neon accent colors, and custom scrollbar and clip-path utilities.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom colors (including neon variants), fonts (Orbitron, Rajdhani, Inter), animations, and plugins for the gaming hardware site theme.",
  "project_state.json": "Project metadata tracking feature requests to add Viper Elite gaming mouse to the products catalog, with pending status for implementation."
}